FROM node:20-slim

# =========================
# 安装 ffmpeg + ffprobe
# =========================
RUN apt-get update && apt-get install -y \
    ffmpeg \
    && rm -rf /var/lib/apt/lists/*

# =========================
# 创建工作目录
# =========================
WORKDIR /app

# =========================
# 复制依赖文件
# =========================
COPY package*.json ./

RUN npm install --production

# =========================
# 复制源码
# =========================
COPY . .

# =========================
# 暴露端口
# =========================
EXPOSE 3000

# =========================
# 启动服务
# =========================
CMD ["node", "main_mp3.js"]